acll/app/controllers/kids_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "kids".* FROM "kids" WHERE "kids"."id" = $1 LIMIT 1  [["id", nil]]
SELECT "kids".* FROM "kids"
---
  def index
    @user = User.find(params[:user_id])
    if current_user == @user
      @kid = Kid.find_by_id(:id)
      @kid = Kid.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "kids".* FROM "kids" WHERE "kids"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
      @user = User.find(params[:user_id])
      id = params[:id]
      @kid = Kid.find(params[:id])

INSERT INTO "kids" ("first_name", "last_name", "address", "city", "zip_code", "guardian_first_name", "guardian_last_name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
      @kid = Kid.new(kid_params)
      @kid.user_id = current_user.id
      if @kid.save

SELECT  "kids".* FROM "kids" WHERE "kids"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
        @kid = Kid.find(params[:id])

SELECT  "kids".* FROM "kids" WHERE "kids"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "kids" SET "first_name" = $1, "updated_at" = $2 WHERE "kids"."id" = $3  [["first_name", "NEILLLLLLLLLLL"], ["updated_at", "2015-10-27 22:03:49.279889"], ["id", 1]]
---
  def update
    @kid = Kid.find(params[:id])
        if @kid.update(kid_params)