acll/app/controllers/leagues_controller.rb

SELECT  "leagues".* FROM "leagues"  ORDER BY "leagues"."id" ASC LIMIT 1
---
  def index
    @leagues = League.all

SELECT  "leagues".* FROM "leagues" WHERE (#<League::ActiveRecord_Relation:0x007f815abd1630>) LIMIT 1
---
  def show
      id = params[:id]
      byebug
      @league = League.find(params[:id])