acll/app/controllers/teams_controller.rb

SELECT  "teams".* FROM "teams" WHERE (5) LIMIT 1
---
  def index
    @teams = Team.all