acll/app/controllers/teams_controller.rb

  def index
    @league = League.find(params[:league_id])
    #@team = Team.find(params[:id])
    @teams = Team.where(league_id: @league.id)
---
SELECT  "leagues".* FROM "leagues" WHERE "leagues"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "teams".* FROM "teams" WHERE "teams"."league_id" = $1  [["league_id", 2]]

  def show
    #@league = League.find(params[:league])
    #@kid = Kid.find(params[:kid_id])
    @team = Team.find(params[:id])
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT 1  [["id", 1]]

  def new
    @league = League.find(params[:league_id])
---
SELECT  "leagues".* FROM "leagues" WHERE "leagues"."id" = $1 LIMIT 1  [["id", 1]]

  def create
      @league = League.find(params[:league_id])
      @team = Team.new(team_params)
      @team.league_id = @league.id
      # need logic for admin here
      if @team.save
---
SELECT  "leagues".* FROM "leagues" WHERE "leagues"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "teams" ("name", "coach1", "coach2", "coach3", "league_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "A's"], ["coach1", "Jake"], ["coach2", ""], ["coach3", ""], ["league_id", 1], ["created_at", "2015-10-28 15:09:47.389798"], ["updated_at", "2015-10-28 15:09:47.389798"]]